app/controllers/photos_controller.rb

	def create
		@photo = Photo.new(photo_params)
		if @photo.save
---
INSERT INTO "photos" ("created_at", "image_uid", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-01 02:09:59.647808"], ["image_uid", "2014/08/31/6sqlm3anoi_904172_350810815030766_452180736_o.jpg"], ["title", "photography1"], ["updated_at", "2014-09-01 02:09:59.647808"]]